{
  "LanguageSwitcher": {
    "label": "Languages"
  },
  "Header": {
    "header_menu_1": "Home",
    "header_menu_2": "Work",
    "header_menu_3": "Resume",
    "header_menu_4": "Contact"
  },
  "Footer": {
    "footer_send_email": "Send me a mail",
    "footer_email_subject": "I'd like to learn more about your work, Abner!",
    "footer_copyrights": "© Copyright 2026, Abner Ferreira. All Rights Reserved."
  },
  "Homepage": {
    "hero_greetings": "Hi there! I'm Abner Ferreira",
    "hero_introduction": "I am a <bolderWord>Full Stack Developer</bolderWord> focused on building <bolderWord>Modern</bolderWord>, <bolderWord>Accessible</bolderWord>, <bolderWord>Scalable</bolderWord> and <bolderWord>Responsive</bolderWord> applications.",
    "hero_description": "Full Stack Engineer specialized in Python on the backend and React, Next.js, and TypeScript on the frontend. I turn challenges into high-performance solutions with fast and precise execution. A strong communicator and effective collaborator, I deliver complex projects on time, combining technical excellence, best practices, and business-driven thinking. A constant innovator, unafraid of the effort required — from pixel-perfect interfaces to the most challenging backend integrations.",
    "hero_image_alt": "Abner cartooned image"
  },
  "Spotlight": {
    "spotlight_title": "Spotlight",
    "spotlight_link": "Visit"
  },
  "Tooling": {
    "tooling_title": "Tooling"
  },
  "Work": {
    "work_title": "< All works />",
    "work_visit_project": "vist ->",
    "work_view_project_code": "view code ->"
  },
  "Projects": {
    "projects_greendrive_description": "GreenDrive is a conceptual platform about automotive sustainability, built with ReactJS, Hooks, Context API, and CSS Module. It features AI-generated content and copyright-free visuals to present eco-friendly technologies through a clean, responsive interface.",
    "projects_greendrive_short": "Eco-friendly car tech with React and clean design UI",
    "projects_portfolio_description": "Portfolio Abner is a personal portfolio website developed using ReactJS and Tailwind CSS, showcasing the developer's skills, projects, and professional background. The application features smooth navigation, responsive design, and interactive components, providing visitors with an engaging overview of the developer's work and expertise.",
    "projects_portfolio_short": "Personal portfolio with React and Tailwind CSS UI",
    "projects_easybank_description": "Easybank is a modern landing page for a fictional digital bank, built with ReactJS and styled using CSS Module. It features a clean, responsive design, focusing on intuitive layout and mobile-first experience to showcase banking services in a clear and engaging way.",
    "projects_easybank_short": "Modern digital bank UI with React and mobile-first CSS",
    "projects_advice_description": "Advice Generator is a minimalist and responsive app built with ReactJS and CSS Module that fetches random advice from the Advice Slip API. The project focuses on API integration, dynamic content updates, and clean UI — all within a simple user interaction experience.",
    "projects_advice_short": "Responsive advice app with API and minimalist design",
    "projects_tipcalculator_description": "Tip Calculator is a responsive and interactive web application built with ReactJS and CSS Module. It allows users to calculate the tip amount and total cost per person based on the bill amount, selected tip percentage, and number of people. This project emphasizes user-friendly design, real-time calculations, and responsive layout, serving as a practical exercise in state management and form handling in React.",
    "projects_tipcalculator_short": "Interactive tip calculator with real-time updates UI",
    "projects_cinetag_description": "Cinetag is a responsive web application developed with ReactJS and Tailwind CSS that allows users to browse and manage a collection of movies. The application features dynamic routing, interactive UI components, and a clean design, offering an engaging user experience. This project emphasizes proficiency in React hooks, routing, and responsive design principles.",
    "projects_cinetag_short": "Movie browser app with React, routing and clean UI",
    "projects_productpage_description": "Corinthians Shirt Product Page is a static product landing page built with ReactJS and Tailwind CSS, simulating the presentation of an official Corinthians football jersey. The project focuses on component structure, UI styling, and layout simulation commonly found on e-commerce pages. Note: this project is not responsive.",
    "projects_productpage_short": "Static product page with React and Tailwind layout",
    "projects_motion_description": "Motion Co. is a corporate website developed for the company Motion-Co, focused on presenting its digital solutions services, process optimization, digital strategy, and talent development. Designed with a modern layout, the website organizes content clearly to communicate the company’s value proposition and business services, while also showcasing clients and contact information. The project emphasizes content structure, visual presentation, and clean navigation for a corporate audience.",
    "projects_motion_short": "Corporate website built with React and TypeScript using a Tailwind layout"
  },
  "Error": {
    "error_title": "Oops! Page not found",
    "error_description": "Oops! It looks like this page isn't available right now. Our dog accidentally ate it. Please go back to the homepage and keep browsing.",
    "error_button": "Back to Home",
    "error_type": "<redWord>404</redWord> - Error"
  }
}